[Killed] ConditionalExpression
townService/src/lib/CoveyTownController.ts:124:9
     this._sessions = this._sessions.filter(s => s.sessionToken !== session.sessionToken);
     this._listeners.forEach(listener => listener.onPlayerDisconnected(session.player));
     const conversation = session.player.activeConversationArea;
-    if (conversation) {
+    if (false) {
       this.removePlayerFromConversationArea(session.player, conversation);
     }
killedBy: CoveyTownController Conversation Areas updatePlayerLocation should remove a participant if they disconnect [T2.2]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
townService/src/lib/CoveyTownController.ts:143:9
     const conversation = this.conversationAreas.find(conv => conv.label === location.conversationLabel);
     const prevConversation = player.activeConversationArea;
     player.updateLocation(location, conversation);
-    if (conversation !== prevConversation) {
+    if (false) {
       if (prevConversation) {
         this.removePlayerFromConversationArea(player, prevConversation);
killedBy: CoveyTownController Conversation Areas updatePlayerLocation should set a conversation area's occupantsByID property when a player moves into a conversation area [T2.1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
townService/src/lib/CoveyTownController.ts:143:9
     const conversation = this.conversationAreas.find(conv => conv.label === location.conversationLabel);
     const prevConversation = player.activeConversationArea;
     player.updateLocation(location, conversation);
-    if (conversation !== prevConversation) {
+    if (true) {
       if (prevConversation) {
         this.removePlayerFromConversationArea(player, prevConversation);
killedBy: CoveyTownController Conversation Areas updatePlayerLocation should only emit onConversationUpdated events for conversations that update [T2.1]
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"boundingBox": {"height": 10, "width": 5, "x": 10, "y": 10}, "label": "Label0", "occupantsByID": ["uf169aay0jbP92BjwO2iK"], "topic": "Topic0"}

[Killed] ConditionalExpression
townService/src/lib/CoveyTownController.ts:144:11
     const prevConversation = player.activeConversationArea;
     player.updateLocation(location, conversation);
     if (conversation !== prevConversation) {
-      if (prevConversation) {
+      if (false) {
         this.removePlayerFromConversationArea(player, prevConversation);
       }
killedBy: CoveyTownController Conversation Areas updatePlayerLocation should emit onConversationUpdated when players enter or exit [T2.1]
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
townService/src/lib/CoveyTownController.ts:144:11
     const prevConversation = player.activeConversationArea;
     player.updateLocation(location, conversation);
     if (conversation !== prevConversation) {
-      if (prevConversation) {
+      if (true) {
         this.removePlayerFromConversationArea(player, prevConversation);
       }
killedBy: CoveyTownController Conversation Areas updatePlayerLocation should set a conversation area's occupantsByID property when a player moves into a conversation area [T2.1]
statusReason: TypeError: Cannot read properties of undefined (reading 'occupantsByID')

[Killed] ConditionalExpression
townService/src/lib/CoveyTownController.ts:147:11
       if (prevConversation) {
         this.removePlayerFromConversationArea(player, prevConversation);
       }
-      if (conversation) {
+      if (false) {
         conversation.occupantsByID.push(player.id);
         this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
killedBy: CoveyTownController Conversation Areas updatePlayerLocation should set a conversation area's occupantsByID property when a player moves into a conversation area [T2.1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
townService/src/lib/CoveyTownController.ts:179:75
    *
    * @returns true if the conversation is successfully created, or false if not
    */
-  addConversationArea(_conversationArea: ServerConversationArea): boolean {
-    if (
-      this._conversationAreas.find(
-        eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
-      )
-    )
-      return false;
-    if (_conversationArea.topic === ''){
-      return false;
-    }
-    if (this._conversationAreas.find(eachExistingConversation => CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
-      return false;
-    }
-    const newArea :ServerConversationArea = Object.assign(_conversationArea);
-    this._conversationAreas.push(newArea);
-    const playersInThisConversation = this.players.filter(player =>
-      player.isWithin(newArea),
-    );
-    playersInThisConversation.forEach(
-      player => (player.updateLocation(player.location, newArea)),
-    );
-    newArea.occupantsByID = playersInThisConversation.map(player => player.id);
-    this._listeners.forEach(listener => listener.onConversationAreaUpdated(newArea));
-    return true;
-  }
+  addConversationArea(_conversationArea: ServerConversationArea): boolean {}
 
   static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{
killedBy: CoveyTownController Conversation Areas addConversationArea should add the conversation area to the list of conversation areas [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
townService/src/lib/CoveyTownController.ts:182:37
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (
       this._conversationAreas.find(
-        eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+        eachExistingConversation => eachExistingConversation.label !== _conversationArea.label,
       )
     )
killedBy: CoveyTownController Conversation Areas addConversationArea should check to see if a conversation area exists with the given label [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
townService/src/lib/CoveyTownController.ts:186:40
       )
     )
       return false;
-    if (_conversationArea.topic === ''){
-      return false;
-    }
+    if (_conversationArea.topic === ''){}
     if (this._conversationAreas.find(eachExistingConversation => CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
       return false;
killedBy: CoveyTownController Conversation Areas addConversationArea should not allow an empty topic [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
townService/src/lib/CoveyTownController.ts:189:183
     if (_conversationArea.topic === ''){
       return false;
     }
-    if (this._conversationAreas.find(eachExistingConversation => CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
-      return false;
-    }
+    if (this._conversationAreas.find(eachExistingConversation => CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){}
     const newArea :ServerConversationArea = Object.assign(_conversationArea);
     this._conversationAreas.push(newArea);
killedBy: CoveyTownController Conversation Areas addConversationArea should check for overlapping bounding boxes [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
townService/src/lib/CoveyTownController.ts:189:38
     if (_conversationArea.topic === ''){
       return false;
     }
-    if (this._conversationAreas.find(eachExistingConversation => CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
+    if (this._conversationAreas.find(() => undefined) !== undefined){
       return false;
     }
killedBy: CoveyTownController Conversation Areas addConversationArea should check for overlapping bounding boxes [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
townService/src/lib/CoveyTownController.ts:190:14
       return false;
     }
     if (this._conversationAreas.find(eachExistingConversation => CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
-      return false;
+      return true;
     }
     const newArea :ServerConversationArea = Object.assign(_conversationArea);
killedBy: CoveyTownController Conversation Areas addConversationArea should check for overlapping bounding boxes [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
townService/src/lib/CoveyTownController.ts:194:59
     }
     const newArea :ServerConversationArea = Object.assign(_conversationArea);
     this._conversationAreas.push(newArea);
-    const playersInThisConversation = this.players.filter(player =>
-      player.isWithin(newArea),
+    const playersInThisConversation = this.players.filter(() => undefined,
     );
     playersInThisConversation.forEach(
killedBy: CoveyTownController Conversation Areas addConversationArea should include players in the bounding box as occupants when a conversation is created and set their activeConversation property [T1.2b]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 0

[Killed] ArrowFunction
townService/src/lib/CoveyTownController.ts:198:7
       player.isWithin(newArea),
     );
     playersInThisConversation.forEach(
-      player => (player.updateLocation(player.location, newArea)),
+      () => undefined,
     );
     newArea.occupantsByID = playersInThisConversation.map(player => player.id);
killedBy: CoveyTownController Conversation Areas addConversationArea should include players in the bounding box as occupants when a conversation is created and set their activeConversation property [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] ArrowFunction
townService/src/lib/CoveyTownController.ts:200:59
     playersInThisConversation.forEach(
       player => (player.updateLocation(player.location, newArea)),
     );
-    newArea.occupantsByID = playersInThisConversation.map(player => player.id);
+    newArea.occupantsByID = playersInThisConversation.map(() => undefined);
     this._listeners.forEach(listener => listener.onConversationAreaUpdated(newArea));
     return true;
killedBy: CoveyTownController Conversation Areas addConversationArea should include players in the bounding box as occupants when a conversation is created and set their activeConversation property [T1.2b]
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
townService/src/lib/CoveyTownController.ts:205:68
     return true;
   }
 
-  static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{
-    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
-    const rect1 = toRectPoints(box1);
-    const rect2 = toRectPoints(box2);
-    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
-    return !noOverlap;
-  }
+  static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{}
 
   /**
killedBy: CoveyTownController Conversation Areas addConversationArea should check for overlapping bounding boxes [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
townService/src/lib/CoveyTownController.ts:206:90
   }
 
   static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{
-    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
+    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width * 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
killedBy: CoveyTownController Conversation Areas addConversationArea should check for overlapping bounding boxes [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
townService/src/lib/CoveyTownController.ts:206:137
   }
 
   static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{
-    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
+    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y - box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
killedBy: CoveyTownController Conversation Areas addConversationArea should check for overlapping bounding boxes [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
townService/src/lib/CoveyTownController.ts:209:95
     const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
-    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
+    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 < rect1.y2;
     return !noOverlap;
   }
killedBy: CoveyTownController Conversation Areas addConversationArea should check for overlapping bounding boxes [T1.2b]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
