[Killed] BlockStatement
townService/src/requestHandlers/CoveyTownRequestHandlers.ts:184:133
  * * Ask the TownController to create the conversation area
  * @param _requestData Conversation area create request
  */
-export function conversationAreaCreateHandler(_requestData: ConversationAreaCreateRequest) : ResponseEnvelope<Record<string, null>> {
-  const townsStore = CoveyTownsStore.getInstance();
-  const townController = townsStore.getControllerForTown(_requestData.coveyTownID);
-  if (!townController?.getSessionByToken(_requestData.sessionToken)){
-    return {
-      isOK: false, response: {}, message: `Unable to create conversation area ${_requestData.conversationArea.label} with topic ${_requestData.conversationArea.topic}`,
-    };
-  }
-  const success = townController.addConversationArea(_requestData.conversationArea);
-
-  return {
-    isOK: success,
-    response: {},
-    message: !success ? `Unable to create conversation area ${_requestData.conversationArea.label} with topic ${_requestData.conversationArea.topic}` : undefined,
-  };
-}
+export function conversationAreaCreateHandler(_requestData: ConversationAreaCreateRequest) : ResponseEnvelope<Record<string, null>> {}
 /**
  * An adapter between CoveyTownController's event interface (CoveyTownListener)
killedBy: Create Conversation Area API REST API Executes without error when creating a new conversation [T1.1]
statusReason: Error: Error processing request: undefined

[Killed] ConditionalExpression
townService/src/requestHandlers/CoveyTownRequestHandlers.ts:187:7
 export function conversationAreaCreateHandler(_requestData: ConversationAreaCreateRequest) : ResponseEnvelope<Record<string, null>> {
   const townsStore = CoveyTownsStore.getInstance();
   const townController = townsStore.getControllerForTown(_requestData.coveyTownID);
-  if (!townController?.getSessionByToken(_requestData.sessionToken)){
+  if (false){
     return {
       isOK: false, response: {}, message: `Unable to create conversation area ${_requestData.conversationArea.label} with topic ${_requestData.conversationArea.topic}`,
killedBy: Create Conversation Area API conversationAreaCreateHandler On a request where a conversation exists with this name Returns the correct error message [T1.2a]
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
townService/src/requestHandlers/CoveyTownRequestHandlers.ts:187:7
 export function conversationAreaCreateHandler(_requestData: ConversationAreaCreateRequest) : ResponseEnvelope<Record<string, null>> {
   const townsStore = CoveyTownsStore.getInstance();
   const townController = townsStore.getControllerForTown(_requestData.coveyTownID);
-  if (!townController?.getSessionByToken(_requestData.sessionToken)){
+  if (townController?.getSessionByToken(_requestData.sessionToken)){
     return {
       isOK: false, response: {}, message: `Unable to create conversation area ${_requestData.conversationArea.label} with topic ${_requestData.conversationArea.topic}`,
killedBy: Create Conversation Area API REST API Executes without error when creating a new conversation [T1.1]
statusReason: Error: Error processing request: Unable to create conversation area KrpRWM-6ZRmecF5EUKp9W with topic EX7QZyMGalSJMX3Pvxxd-
